nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_edma.c
/*
 * Copyright 2020 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_edma.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "platform.drivers.dsc_edma"
#endif

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
/*!
 * @brief Sets all fields to 0 for the TCD structure.
 *
 * This function sets all fields for this TCD structure to zero.
 *
 * @param psTcd Pointer to the TCD structure.
 */
static void EDMA_TcdReset(edma_channel_tcd_t *psTcd);

/*******************************************************************************
 * Variables
 ******************************************************************************/

/*! @brief Array to map EDMA instance number to base pointer. */
static DMA_Type *const s_edmaBases[] = DMA_BASE_PTRS;

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
/*! @brief Array to map EDMA instance number to clock name. */
static const clock_ip_name_t s_edmaClockName[] = EDMA_CLOCKS;
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */

/*! @brief Array to map EDMA instance number to IRQ number. */
static const IRQn_Type s_edmaIRQNumber[][FSL_FEATURE_EDMA_MODULE_CHANNEL] = DMA_CHN_IRQS;

/*! @brief Pointers to transfer handle for each EDMA channel. */
static edma_handle_t *s_EDMAHandle[FSL_FEATURE_EDMA_MODULE_CHANNEL * FSL_FEATURE_SOC_EDMA_COUNT];
/*******************************************************************************
 * Code
 ******************************************************************************/
static uint32_t EDMA_GetInstance(DMA_Type *base)
{
    uint32_t u32Instance;

    /* Find the instance index from base address mappings. */
    for (u32Instance = 0; u32Instance < ARRAY_SIZE(s_edmaBases); u32Instance++)
    {
        if (s_edmaBases[u32Instance] == base)
        {
            break;
        }
    }

    assert(u32Instance < ARRAY_SIZE(s_edmaBases));

    return u32Instance;
}

static uint32_t EDMA_GetInstanceOffset(uint32_t u32Instance)
{
    static uint8_t u8StartInstanceNum;

#if defined(DMA0)
    u8StartInstanceNum = (uint8_t)EDMA_GetInstance(DMA0);
#elif defined(DMA1)
    u8StartInstanceNum = (uint8_t)EDMA_GetInstance(DMA1);
#elif defined(DMA2)
    u8StartInstanceNum = (uint8_t)EDMA_GetInstance(DMA2);
#elif defined(DMA3)
    u8StartInstanceNum = (uint8_t)EDMA_GetInstance(DMA3);
#endif

    assert(u8StartInstanceNum <= u32Instance);

    return u32Instance - u8StartInstanceNum;
}

static void EDMA_TcdReset(edma_channel_tcd_t *psTcd)
{
    assert(psTcd != NULL);
    assert(((uint32_t)((uint8_t *)psTcd) & 0x1FU) == 0U);

    /* Reset channel TCD */
    psTcd->u32SADDR     = 0U;
    psTcd->u16SOFF      = 0U;
    psTcd->u16ATTR      = 0U;
    psTcd->u32NBYTES    = 0U;
    psTcd->u32SLAST     = 0U;
    psTcd->u32DADDR     = 0U;
    psTcd->u16DOFF      = 0U;
    psTcd->u16CITER     = 0U;
    psTcd->u32DLAST_SGA = 0U;
    psTcd->u16CSR       = 0U;
    psTcd->u16BITER     = 0U;
}

/*!
 * brief Get default edma configuration.
 *
 * note This function will reset all of the configuration structure members to zero firstly,
 *       then apply default configurations to the structure.
 *
 * param psConfig pointer to user's eDMA configure structure, see edma_config_t for detail.
 */
void EDMA_GetDefaultConfig(edma_config_t *psConfig)
{
    assert(psConfig != NULL);

    uint16_t i = 0U;

    memset(psConfig, 0U, sizeof(edma_config_t));

    psConfig->eArbitrationType          = kEDMA_ArbitrationFixedPriority;
    psConfig->bEnableHaltOnError        = true;
    psConfig->bEnableContinuousLinkMode = false;
    psConfig->bEnableDmaInDebugMode     = false;
    psConfig->bEnableMinorLoopMapping   = true;

    for (i = 0U; i < FSL_FEATURE_EDMA_MODULE_CHANNEL; i++)
    {
        psConfig->sChannelPreemptionConfig[i].bSuspendedByHighPriorityChannel = false;
        psConfig->sChannelPreemptionConfig[i].bSuspendLowPriorityChannel      = false;
        psConfig->sChannelPreemptionConfig[i].u8ChannelPriority               = i;
    }
}

/*!
 * brief EDMA initialization
 *
 * param base eDMA peripheral base address.
 * param psConfig pointer to user's eDMA configure structure, see edma_transfer_config_t for detail.
 */
void EDMA_Init(DMA_Type *base, edma_config_t *psConfig)
{
    assert(psConfig != NULL);

    uint32_t u32tmpCSR, i = 0U;
#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
    /* Ungate EDMA peripheral clock */
    CLOCK_EnableClock(s_edmaClockName[EDMA_GetInstance(base)]);
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */

    /* clear all the enabled request, status to make sure EDMA status is in normal condition */
    base->CERQ = 0x40U;
    base->CINT = 0x40U;
    base->CERR = 0x40U;
    base->CDNE = 0x40U;

    /* Configure EDMA peripheral according to the configuration structure. */
    u32tmpCSR = base->CR;
    u32tmpCSR &= ~(DMA_CR_ERCA_MASK | DMA_CR_HOE_MASK | DMA_CR_CLM_MASK | DMA_CR_EDBG_MASK);
    u32tmpCSR |= (DMA_CR_ERCA(psConfig->eArbitrationType) | DMA_CR_HOE(psConfig->bEnableHaltOnError) |
                  DMA_CR_CLM(psConfig->bEnableContinuousLinkMode) | DMA_CR_EDBG(psConfig->bEnableDmaInDebugMode) |
                  DMA_CR_EMLM(psConfig->bEnableMinorLoopMapping));
    base->CR = u32tmpCSR;

    /* channel preemption configuration */
    if (psConfig->eArbitrationType == kEDMA_ArbitrationFixedPriority)
    {
        EDMA_SetChannelPreemption(base, (edma_channel_t)i,
                                  psConfig->sChannelPreemptionConfig[i].bSuspendedByHighPriorityChannel,
                                  psConfig->sChannelPreemptionConfig[i].bSuspendLowPriorityChannel,
                                  psConfig->sChannelPreemptionConfig[i].u8ChannelPriority);
    }

