nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_edma.c
    /* channel transfer configuration */
    for (i = 0U; i < FSL_FEATURE_EDMA_MODULE_CHANNEL; i++)
    {
        if (psConfig->psChannelTransferConfig[i] != NULL)
        {
            EDMA_SetChannelTransferConfig(base, (edma_channel_t)i, psConfig->psChannelTransferConfig[i]);
        }
    }
}

/*!
 * @brief EDMA De-initialization
 *
 * @param base eDMA peripheral base address.
 */
void EDMA_Deinit(DMA_Type *base)
{
#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
    /* Ungate EDMA peripheral clock */
    CLOCK_DisableClock(s_edmaClockName[EDMA_GetInstance(base)]);
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */
}

/*!
 * brief Get channel default transfer configuration.
 *
 * note 1. This function will reset all of the configuration structure members to zero firstly,
 *       then apply default configurations to the structure.
 *       2. No interrupt enabled by this function by default, if application would like to use DMA interrupt
 *          please enable it manually by psTransfer->u16EnabledInterruptMask = _edma_channel_interrupt
 *
 * param psConfig pointer to user's eDMA channel configure structure, see edma_channel_transfer_config_t for detail.
 * param pSrcAddr source address, must be byte address.
 * param pDstAddr destination address,  must be byte address.
 * param u32BytesEachRequest bytes to be transferred in each request(namely, in each minor loop).
 * param u32TotalBytes total bytes to be transferred.
 * param eTransferWidth, it represents how many bits are transferred in each read/write.
 * param eTransferType eDMA channel transfer type.
 */
void EDMA_GetChannelDefaultTransferConfig(edma_channel_transfer_config_t *psTransfer,
                                          void *pSrcAddr,
                                          void *pDstAddr,
                                          uint32_t u32BytesEachRequest,
                                          uint32_t u32TotalBytes,
                                          edma_channel_transfer_width_t eTransferWidth,
                                          edma_channel_transfer_type_t eTransferType)
{
    assert(psTransfer != NULL);
    assert(((u32TotalBytes % u32BytesEachRequest) == 0U));

    (void)memset(psTransfer, 0U, sizeof(edma_channel_transfer_config_t));

    psTransfer->pSrcAddr                        = pSrcAddr;
    psTransfer->pDstAddr                        = pDstAddr;
    psTransfer->eSrcWidthOfEachTransfer         = eTransferWidth;
    psTransfer->eDstWidthOfEachTransfer         = eTransferWidth;
    psTransfer->u32BytesEachMinorLoop           = u32BytesEachRequest;
    psTransfer->u16MinorLoopCountsEachMajorLoop = u32TotalBytes / u32BytesEachRequest;

    /* default advance channel transfer configurations */
    psTransfer->eSrcAddrModulo = kEDMA_ChannelModuloDisable;
    psTransfer->eDstAddrModulo = kEDMA_ChannelModuloDisable;

    if (eTransferType == kEDMA_ChannelTransferMemoryToMemory)
    {
        psTransfer->i16SrcOffsetOfEachTransfer = 1U << eTransferWidth;
        psTransfer->i16DstOffsetOfEachTransfer = 1U << eTransferWidth;
    }
    else if (eTransferType == kEDMA_ChannelTransferPeripheralToMemory)
    {
        psTransfer->i16SrcOffsetOfEachTransfer = 0U;
        psTransfer->i16DstOffsetOfEachTransfer = 1U << eTransferWidth;
    }
    else if (eTransferType == kEDMA_ChannelTransferMemoryToPeripheral)
    {
        psTransfer->i16SrcOffsetOfEachTransfer = 1U << eTransferWidth;
        psTransfer->i16DstOffsetOfEachTransfer = 0U;
    }
    else
    {
        psTransfer->i16SrcOffsetOfEachTransfer = 0U;
        psTransfer->i16DstOffsetOfEachTransfer = 0U;
    }

    psTransfer->bEnableSrcMinorLoopOffset = false;
    psTransfer->bEnableDstMinorLoopOffset = false;
    psTransfer->i32MinorLoopOffset        = 0U;

    psTransfer->i32SrcMajorLoopOffset = 0U;
    psTransfer->i32DstMajorLoopOffset = 0U;

    psTransfer->bEnableChannelMajorLoopLink = false;
    psTransfer->bEnableChannelMinorLoopLink = false;
    /* no interrupt enable by default */
    psTransfer->u16EnabledInterruptMask = 0U;

    psTransfer->eChannelBandWidth                     = kEDMA_ChannelBandwidthStallNone;
    psTransfer->bDisableRequestAfterMajorLoopComplete = true;

    psTransfer->bEnableChannelRequest = false;
}

/*!
 * brief EDMA set channel transfer configurations
 *
 * param base eDMA peripheral base address.
 * param eChannel eDMA channel number.
 * param psTransfer pointer to user's eDMA channel configure structure, see edma_channel_transfer_config_t for detail.
 *
 * note
 * 1.This function must not be called while the channel transfer is ongoing
 * or it causes unpredictable results.
 * 2.The psLinkTCD must be configured before invoke this API if scatter/gather function is needed
 * 3.The edma channel request may be enabled after the channel transfer configure done according to the transfer
 *   configurations.
 *
 */
void EDMA_SetChannelTransferConfig(DMA_Type *base, edma_channel_t eChannel, edma_channel_transfer_config_t *psTransfer)
{
    assert(eChannel < (uint32_t)FSL_FEATURE_EDMA_MODULE_CHANNEL);
    assert(psTransfer != NULL);

    edma_channel_tcd_t *psTcdRegs = NULL;

    /*
       Reset TCD registers to zero.
    */
    psTcdRegs = (edma_channel_tcd_t *)(uint32_t)&base->TCD[eChannel];
    EDMA_TcdReset(psTcdRegs);

    /* minor loop mapping need to enabled for minor loop offset feature */
    if (((psTransfer->bEnableSrcMinorLoopOffset) || (psTransfer->bEnableDstMinorLoopOffset)))
    {
        EDMA_EnableMinorLoopMapping(base, true);
    }
    /* configure TCD */
    EDMA_ConfigChannelSoftwareTCD(psTcdRegs, psTransfer);

    EDMA_EnableChannelInterrupts(base, eChannel,
                                 psTransfer->u16EnabledInterruptMask & kEDMA_ChannelErrorInterruptEnable, true);
    EDMA_EnableChannelRequest(base, eChannel, psTransfer->bEnableChannelRequest);
}

/*!
 * brief Gets the eDMA channel status flags.
 *
 * param base eDMA peripheral base address.
 * param eChannel eDMA channel number.
 * return The mask of channel status flags. Users need to use the
 *         _edma_channel_status_flags type to decode the return variables.
 */
uint16_t EDMA_GetChannelStatusFlags(DMA_Type *base, edma_channel_t eChannel)
{
    assert(eChannel < (uint32_t)FSL_FEATURE_EDMA_MODULE_CHANNEL);

    uint16_t retval = 0;

