nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_edma.c
    /* Get DONE bit flag */
    if ((base->TCD[eChannel].CSR & DMA_CSR_DONE_MASK) != 0U)
    {
        retval |= (uint16_t)kEDMA_ChannelStatusMajorLoopCompleteFlag;
    }
    else
    {
        if (((base->INT >> eChannel) & 0x1U) != 0U)
        {
            retval |= (uint16_t)kEDMA_ChannelStatusMajorLoopHalfCompleteFlag;
        }
    }

    /* Get ERROR bit flag */
    if (((base->ERR >> eChannel) & 0x1U) != 0U)
    {
        retval |= (uint16_t)kEDMA_ChannelStatusErrorFlag;
    }

    return retval;
}

/*!
 * brief Clears the eDMA channel status flags.
 *
 * param base eDMA peripheral base address.
 * param eChannel eDMA channel number.
 * param u16StatusFlags The mask of channel status to be cleared. Users need to use
 *             the defined _edma_channel_status_flags type.
 */
void EDMA_ClearChannelStatusFlags(DMA_Type *base, edma_channel_t eChannel, uint16_t u16StatusFlags)
{
    assert(eChannel < (uint32_t)FSL_FEATURE_EDMA_MODULE_CHANNEL);

    /* Clear complete status bit flag */
    if (0U != (u16StatusFlags & (uint16_t)kEDMA_ChannelStatusMajorLoopCompleteFlag))
    {
        base->CDNE = (uint8_t)eChannel;
        base->CINT = (uint8_t)eChannel;
    }
    /* Clear ERROR bit flag */
    if (0U != (u16StatusFlags & (uint16_t)kEDMA_ChannelStatusErrorFlag))
    {
        base->CERR = (uint8_t)eChannel;
    }
    /* Clear half complete status flag */
    if (0U != (u16StatusFlags & (uint16_t)kEDMA_ChannelStatusMajorLoopHalfCompleteFlag))
    {
        base->CINT = (uint8_t)eChannel;
    }
}

/*!
 * brief Configures the eDMA channel minor loop offset value.
 *
 * The minor offset means that the signed-extended value is added to the source address or destination
 * address after each minor loop.
 *
 * param base eDMA peripheral base address.
 * param eChannel eDMA channel number.
 * param bEnableSrcMinorLoopOffset, true is enable source address minor offset, otherwise is disable
 * param bEnableDestMinorLoopOffset, true is enable source address minor offset, otherwise is disable
 * param i32MinorLoopOffset , minor loop offset value.
 */
void EDMA_SetChannelMinorLoopOffset(DMA_Type *base,
                                    edma_channel_t eChannel,
                                    bool bEnableSrcMinorLoopOffset,
                                    bool bEnableDestMinorLoopOffset,
                                    int32_t i32MinorLoopOffset)
{
    assert(eChannel < (uint32_t)FSL_FEATURE_EDMA_MODULE_CHANNEL);

    uint32_t u32Tmpreg;

    u32Tmpreg = base->TCD[eChannel].NBYTES_MLOFFYES;
    u32Tmpreg &= ~(DMA_NBYTES_MLOFFYES_SMLOE_MASK | DMA_NBYTES_MLOFFYES_DMLOE_MASK | DMA_NBYTES_MLOFFYES_MLOFF_MASK);
    u32Tmpreg |=
        (DMA_NBYTES_MLOFFYES_SMLOE(bEnableSrcMinorLoopOffset) | DMA_NBYTES_MLOFFYES_DMLOE(bEnableDestMinorLoopOffset) |
         DMA_NBYTES_MLOFFYES_MLOFF(i32MinorLoopOffset));
    base->TCD[eChannel].NBYTES_MLOFFYES = u32Tmpreg;
}

/*!
 * brief Configures the eDMA channel major loop offset feature.
 *
 * Adjustment value added to the source/destination address at the completion of the major iteration count
 *
 * param base eDMA peripheral base address.
 * param eChannel edma channel number.
 * param i32SourceOffset source address offset.
 * param i32DestOffset destination address offset.
 */
void EDMA_SetChannelMajorLoopOffset(DMA_Type *base,
                                    edma_channel_t eChannel,
                                    int32_t i32SourceOffset,
                                    int32_t i32DestOffset)
{
    assert(eChannel < (uint32_t)FSL_FEATURE_EDMA_MODULE_CHANNEL);

    base->TCD[eChannel].SLAST     = (uint32_t)i32SourceOffset;
    base->TCD[eChannel].DLAST_SGA = (uint32_t)i32DestOffset;
}

/*!
 * brief Configures the eDMA channel preemption configurations.
 *
 * This function configures the channel preemption attribute and the priority of the channel.
 *
 * param base eDMA peripheral base address.
 * param eChannel eDMA channel number
 * param bSuspendedByHighPriorityChannel, true is the channel can be suspended by high priority channel, otherwise
 cannot.
 * param bSuspendLowPriorityChannel, true is the channel can suspend low priority channel, otherwise cannot.
 * param priority, channel priority.
 *
 * note, this function is used only in  fixed-priority channel arbitration mode.
 */
void EDMA_SetChannelPreemption(DMA_Type *base,
                               edma_channel_t eChannel,
                               bool bSuspendedByHighPriorityChannel,
                               bool bSuspendLowPriorityChannel,
                               uint8_t u8Priority)
{
    assert(eChannel < (uint32_t)FSL_FEATURE_EDMA_MODULE_CHANNEL);

    volatile uint8_t *tmpReg = &base->DCHPRI3;

    tmpReg[DMA_DCHPRI_INDEX(eChannel)] =
        (DMA_DCHPRI0_DPA((true == bSuspendLowPriorityChannel ? 0U : 1U)) |
         DMA_DCHPRI0_ECP((true == bSuspendedByHighPriorityChannel ? 1U : 0U)) | DMA_DCHPRI0_CHPRI(u8Priority));
}

/*!
 * brief Enable the major loop channel link and configure the linked channel number.
 *
 * This function configures the major link mode. The major link means that the channel link is triggered when the CITER
 * is exhausted.
 *
 * param base eDMA peripheral base address.
 * param eChannel eDMA channel number.
 * param eLinkChannel The linked channel number.
 * note Users should ensure that DONE flag is cleared before calling this interface, or the configuration is invalid.
 */
void EDMA_EnableMajorLoopChannelLink(DMA_Type *base, edma_channel_t eChannel, edma_channel_t eLinkChannel)
{
    uint16_t tmpreg;

    tmpreg                  = base->TCD[eChannel].CSR & (~(uint16_t)DMA_CSR_MAJORLINKCH_MASK);
    base->TCD[eChannel].CSR = tmpreg | DMA_CSR_MAJORLINKCH(eLinkChannel) | DMA_CSR_MAJORELINK_MASK;
}

/*!
 * brief Enable the minor loop channel link and configure the linked channel number.
 *
 * This function configures the minor link mode. The minor link means that the channel link is
 * triggered every time CITER decreases by 1.
 *
 * param base eDMA peripheral base address.
 * param eChannel eDMA channel number.
 * param eLinkChannel The linked channel number.
 * note Users should ensure that DONE flag is cleared before calling this interface, or the configuration is invalid.
 */
void EDMA_EnableMinorLoopChannelLink(DMA_Type *base, edma_channel_t eChannel, edma_channel_t eLinkChannel)
{
    uint16_t tmpreg;

