nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_edma.c
    tmpreg = base->TCD[eChannel].CITER_ELINKYES & (~(uint16_t)DMA_CITER_ELINKYES_LINKCH_MASK);
    tmpreg |= DMA_CITER_ELINKYES_LINKCH(eLinkChannel);
    base->TCD[eChannel].CITER_ELINKYES = tmpreg | DMA_CITER_ELINKYES_ELINK_MASK;
    tmpreg = base->TCD[eChannel].BITER_ELINKYES & (~(uint16_t)DMA_BITER_ELINKYES_LINKCH_MASK);
    tmpreg |= DMA_BITER_ELINKYES_LINKCH(eLinkChannel);
    base->TCD[eChannel].BITER_ELINKYES = tmpreg | DMA_BITER_ELINKYES_ELINK_MASK;
}

/*!
 * brief Sets the edma channel stall cycles after each R/W.
 *
 * Because the eDMA processes the minor loop, it continuously generates read/write sequences
 * until the minor count is exhausted. The bandwidth forces the eDMA to stall after the completion of
 * each read/write access to control the bus request bandwidth seen by the crossbar switch.
 *
 * NOTE:
 * 1.If the source and destination sizes are equal, this field is ignored between the first and second
 * transfers and after the last write of each minor loop. This behavior is a side effect of reducing
 * start-up latency.
 * 2.When executing a large, zero wait-stated memory-to-memory transfer, insert bandwidth control
 * using the TCD_CSR[BWC] bits to avoid:
•*   Starvation of another master accessing the memory.
•*   Any delay in writing a TCD during the transfer.
 *
 * param base eDMA peripheral base address.
 * param eChannel eDMA channel number.
 * param eBandWidth A bandwidth setting, which can be one of the following:
 *     arg kEDMABandwidthStallNone
 *     arg kEDMABandwidthStall4Cycle
 *     arg kEDMABandwidthStall8Cycle
 */
void EDMA_SetChannelBandWidth(DMA_Type *base, edma_channel_t eChannel, edma_channel_bandwidth_t eBandWidth)
{
    assert(eChannel < (uint32_t)FSL_FEATURE_EDMA_MODULE_CHANNEL);

    base->TCD[eChannel].CSR = (uint16_t)((base->TCD[eChannel].CSR & (~DMA_CSR_BWC_MASK)) | DMA_CSR_BWC(eBandWidth));
}

/*!
 * brief Sets the source address range and the destination address range for the eDMA transfer.
 *
 * This function defines a specific address range of source/destination address, after the source/destination address
 * hits the range boundary, source/destination address will wrap to origin value.
 *
 * Setting this field provides the ability
 * to implement a circular data queue easily. For data queues requiring power-of-2 size bytes, the
 * queue should start at a 0-modulo-size address and the SMOD field should be set to the appropriate
 * value for the queue, freezing the desired number of upper address bits. The value programmed into
 * this field specifies the number of lower address bits allowed to change
 *
 * param base eDMA peripheral base address.
 * param eChannel eDMA channel number.
 * param eSrcModulo A source modulo value.
 * param eDestModulo A destination modulo value.
 */
void EDMA_SetChannelModulo(DMA_Type *base,
                           edma_channel_t eChannel,
                           edma_channel_modulo_t eSrcModulo,
                           edma_channel_modulo_t eDestModulo)
{
    assert(eChannel < (uint32_t)FSL_FEATURE_EDMA_MODULE_CHANNEL);

    uint16_t u16Tmpreg;

    u16Tmpreg                = base->TCD[eChannel].ATTR & (~(uint16_t)(DMA_ATTR_SMOD_MASK | DMA_ATTR_DMOD_MASK));
    base->TCD[eChannel].ATTR = u16Tmpreg | DMA_ATTR_DMOD(eDestModulo) | DMA_ATTR_SMOD(eSrcModulo);
}

/*!
 * brief Enables the edma channel interrupts according to a provided mask,
 *       the mask is a logical OR of enumerator members see _edma_channel_interrupt.
 *
 * param base eDMA peripheral base address.
 * param eChannel eDMA channel number.
 * param u16InterruptsMask the mask is a logical OR of enumerator members see _edma_channel_interrupt.
 * param bEnable true is enable, false is disable.
 */
void EDMA_EnableChannelInterrupts(DMA_Type *base, edma_channel_t eChannel, uint16_t u16InterruptsMask, bool bEnable)
{
    assert(eChannel < (uint32_t)FSL_FEATURE_EDMA_MODULE_CHANNEL);

    /* Enable error interrupt */
    if (0U != (u16InterruptsMask & (uint16_t)kEDMA_ChannelErrorInterruptEnable))
    {
        if (bEnable)
        {
            base->SEEI = DMA_SEEI_SEEI(eChannel);
        }
        else
        {
            base->CEEI = DMA_CEEI_CEEI(eChannel);
        }
    }
    else
    {
        uint16_t u16TempReg = base->TCD[eChannel].CSR;
        /* Enable complete(major) interrupt */
        if (0U != (u16InterruptsMask & (uint32_t)kEDMA_ChannelMajorLoopCompleteInterruptEnable))
        {
            u16TempReg &= ~DMA_CSR_INTMAJOR_MASK;
            u16TempReg |= bEnable ? DMA_CSR_INTMAJOR_MASK : 0U;
        }

        /* Enable Half complete(half major) interrupt */
        if (0U != (u16InterruptsMask & (uint32_t)kEDMA_ChannelMajorLoopHalfCompleteInterruptEnable))
        {
            u16TempReg &= ~DMA_CSR_INTHALF_MASK;
            u16TempReg |= bEnable ? DMA_CSR_INTHALF_MASK : 0U;
        }

        base->TCD[eChannel].CSR = u16TempReg;
    }
}

/*!
 * brief Gets the remaining major loop count from the eDMA current channel TCD.
 *
 * This function checks the TCD (Task Control Descriptor) status for a specified
 * eDMA channel and returns the number of major loop count that has not finished.
 *
 * param base eDMA peripheral base address.
 * param channel eDMA channel number.
 * return Major loop count which has not been transferred yet for the current TCD.
 * note 1. This function can only be used to get unfinished major loop count of transfer without
 *          the next TCD, or it might be inaccuracy.
 *       2. The unfinished/remaining transfer bytes cannot be obtained directly from registers while
 *          the channel is running.
 *          Because to calculate the remaining bytes, the initial NBYTES configured in DMA_TCDn_NBYTES_MLNO
 *          register is needed while the eDMA IP does not support getting it while a channel is active.
 *          In another word, the NBYTES value reading is always the actual (decrementing) NBYTES value the dma_engine
 *          is working with while a channel is running.
 *          Consequently, to get the remaining transfer bytes, a software-saved initial value of NBYTES (for example
 *          copied before enabling the channel) is needed. The formula to calculate it is shown below:
 *          RemainingBytes = RemainingMajorLoopCount * NBYTES(initially configured)
 */
uint32_t EDMA_GetChannelRemainingMajorLoopCount(DMA_Type *base, edma_channel_t eChannel)
{
    assert(eChannel < (uint32_t)FSL_FEATURE_EDMA_MODULE_CHANNEL);

