nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_edma.c
    uint32_t u32RemainingCount = 0;

    if (0U != (DMA_CSR_DONE_MASK & base->TCD[eChannel].CSR))
    {
        u32RemainingCount = 0;
    }
    else
    {
        /* Calculate the unfinished bytes */
        if (0U != (base->TCD[eChannel].CITER_ELINKNO & DMA_CITER_ELINKNO_ELINK_MASK))
        {
            u32RemainingCount = (((uint32_t)base->TCD[eChannel].CITER_ELINKYES & DMA_CITER_ELINKYES_CITER_MASK) >>
                                 DMA_CITER_ELINKYES_CITER_SHIFT);
        }
        else
        {
            u32RemainingCount = (((uint32_t)base->TCD[eChannel].CITER_ELINKNO & DMA_CITER_ELINKNO_CITER_MASK) >>
                                 DMA_CITER_ELINKNO_CITER_SHIFT);
        }
    }

    return u32RemainingCount;
}

/*!
 * brief Push content of TCD structure into hardware TCD register.
 *
 * param base EDMA peripheral base address.
 * param eChannel EDMA channel number.
 * param tcd Point to TCD structure.
 */
void EDMA_InstallChannelSoftwareTCD(DMA_Type *base, edma_channel_t eChannel, edma_channel_tcd_t *psTcd)
{
    assert(eChannel < (uint32_t)FSL_FEATURE_EDMA_MODULE_CHANNEL);
    assert(psTcd != NULL);
    assert(((uint32_t)((uint8_t *)psTcd) & 0x1FU) == 0U);

    /* Push tcd into hardware TCD register */
    base->TCD[eChannel].SADDR         = psTcd->u32SADDR;
    base->TCD[eChannel].SOFF          = psTcd->u16SOFF;
    base->TCD[eChannel].ATTR          = psTcd->u16ATTR;
    base->TCD[eChannel].NBYTES_MLNO   = psTcd->u32NBYTES;
    base->TCD[eChannel].SLAST         = psTcd->u32SLAST;
    base->TCD[eChannel].DADDR         = psTcd->u32DADDR;
    base->TCD[eChannel].DOFF          = psTcd->u16DOFF;
    base->TCD[eChannel].CITER_ELINKNO = psTcd->u16CITER;
    base->TCD[eChannel].DLAST_SGA     = psTcd->u32DLAST_SGA;
    /* Clear DONE bit first, otherwise ESG cannot be set */
    base->TCD[eChannel].CSR           = 0;
    base->TCD[eChannel].CSR           = psTcd->u16CSR;
    base->TCD[eChannel].BITER_ELINKNO = psTcd->u16BITER;
}

/*!
 * brief Sets TCD fields according to the user's channel transfer configuration structure, see
 * edma_channel_transfer_config_t.
 *
 * Application should be careful about the TCD pool buffer storage class,
 * - For the platform has cache, the software TCD should be put in non cache section
 * - The TCD pool buffer should have a consistent storage class.
 *
 * note Application should be careful when using the minor loop offset feature with this function, please make sure the
 * EMLM bit is asserted, although EDMA_SetChannelTransferConfig will set this bit by default, if the bit is cleared,
 * application can use @ref EDMA_EnableMinorLoopMapping to enable the feature.*
 *
 * param psTcd Pointer to the TCD structure.
 * param psTransfer channel transfer configuration pointer.
 *
 */
void EDMA_ConfigChannelSoftwareTCD(edma_channel_tcd_t *psTcd, edma_channel_transfer_config_t *psTransfer)
{
    assert(psTransfer != NULL);
    assert((psTransfer->u32BytesEachMinorLoop % (1U << psTransfer->eSrcWidthOfEachTransfer)) == 0U);
    assert((psTransfer->u32BytesEachMinorLoop % (1U << psTransfer->eDstWidthOfEachTransfer)) == 0U);
    assert((psTransfer->i16SrcOffsetOfEachTransfer % (1U << psTransfer->eSrcWidthOfEachTransfer)) == 0U);
    assert((psTransfer->i16DstOffsetOfEachTransfer % (1U << psTransfer->eDstWidthOfEachTransfer)) == 0U);
    assert(((uint32_t)psTransfer->pSrcAddr % (1U << psTransfer->eSrcWidthOfEachTransfer)) == 0U);
    assert(((uint32_t)psTransfer->pDstAddr % (1U << psTransfer->eDstWidthOfEachTransfer)) == 0U);
    assert(((uint32_t)psTransfer->pSrcAddr % (1UL << psTransfer->eSrcAddrModulo)) == 0U);
    assert(((uint32_t)psTransfer->pDstAddr % (1UL << psTransfer->eDstAddrModulo)) == 0U);

    uint16_t u16Tmpreg;

    /* source address */
    psTcd->u32SADDR = (uint32_t)psTransfer->pSrcAddr;
    /* destination address */
    psTcd->u32DADDR = (uint32_t)psTransfer->pDstAddr;
    /* Source data and destination data transfer size */
    psTcd->u16ATTR =
        DMA_ATTR_SSIZE(psTransfer->eSrcWidthOfEachTransfer) | DMA_ATTR_DSIZE(psTransfer->eDstWidthOfEachTransfer);

    /* Source address signed offset */
    psTcd->u16SOFF = (uint16_t)(psTransfer->i16SrcOffsetOfEachTransfer);
    /* Destination address signed offset */
    psTcd->u16DOFF = (uint16_t)(psTransfer->i16DstOffsetOfEachTransfer);

    if (((psTransfer->bEnableSrcMinorLoopOffset) || (psTransfer->bEnableDstMinorLoopOffset)))
    {
        psTcd->u32NBYTES = DMA_NBYTES_MLOFFYES_NBYTES(psTransfer->u32BytesEachMinorLoop) |
                           DMA_NBYTES_MLOFFYES_MLOFF(psTransfer->i32MinorLoopOffset) |
                           DMA_NBYTES_MLOFFYES_DMLOE(psTransfer->bEnableDstMinorLoopOffset) |
                           DMA_NBYTES_MLOFFYES_SMLOE(psTransfer->bEnableSrcMinorLoopOffset);
    }
    else
    {
        psTcd->u32NBYTES = DMA_NBYTES_MLNO_NBYTES(psTransfer->u32BytesEachMinorLoop);
    }

    /* Current major iteration count */
    psTcd->u16CITER = (uint16_t)(psTransfer->u16MinorLoopCountsEachMajorLoop);
    /* Starting major iteration count */
    psTcd->u16BITER = (uint16_t)(psTransfer->u16MinorLoopCountsEachMajorLoop);
    /* Enable scatter/gather processing */
    if (psTransfer->psLinkTCD != NULL)
    {
        psTcd->u32DLAST_SGA = (uint32_t)((uint8_t *)psTransfer->psLinkTCD);

        psTcd->u16CSR |= (uint16_t)DMA_CSR_ESG_MASK;
    }
    else
    {
        psTcd->u16CSR &= ~(uint16_t)DMA_CSR_ESG_MASK;
        psTcd->u32DLAST_SGA = (uint32_t)psTransfer->i32DstMajorLoopOffset;
    }

    /* configure bandwidth/interrupt/auto disable channel request */
    psTcd->u16CSR |= (psTcd->u16CSR & (~(uint16_t)(DMA_CSR_DREQ_MASK | DMA_CSR_BWC_MASK))) |
                     DMA_CSR_BWC(psTransfer->eChannelBandWidth) |
                     DMA_CSR_DREQ(psTransfer->bDisableRequestAfterMajorLoopComplete) |
                     (psTransfer->u16EnabledInterruptMask & (~kEDMA_ChannelErrorInterruptEnable));

    /* Minor link config */
    if (psTransfer->bEnableChannelMinorLoopLink)
    {
        uint16_t tmpreg;

