nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_edma.c
        /* Enable minor link */
        psTcd->u16CITER |= DMA_CITER_ELINKYES_ELINK_MASK;
        psTcd->u16BITER |= DMA_BITER_ELINKYES_ELINK_MASK;
        /* Set linked channel */
        tmpreg = psTcd->u16CITER & (~(uint16_t)DMA_CITER_ELINKYES_LINKCH_MASK);
        tmpreg |= DMA_CITER_ELINKYES_LINKCH(psTransfer->eMinorLoopLinkChannel);
        psTcd->u16CITER = tmpreg;
        tmpreg          = psTcd->u16BITER & (~(uint16_t)DMA_BITER_ELINKYES_LINKCH_MASK);
        tmpreg |= DMA_BITER_ELINKYES_LINKCH(psTransfer->eMinorLoopLinkChannel);
        psTcd->u16BITER = tmpreg;
    }
    /* Major link config */
    if (psTransfer->bEnableChannelMajorLoopLink)
    {
        uint16_t tmpreg;

        /* Enable major link */
        psTcd->u16CSR |= DMA_CSR_MAJORELINK_MASK;
        /* Set major linked channel */
        tmpreg        = psTcd->u16CSR & (~(uint16_t)DMA_CSR_MAJORLINKCH_MASK);
        psTcd->u16CSR = tmpreg | DMA_CSR_MAJORLINKCH(psTransfer->eMajorLoopLinkChannel);
    }
    /* clear link relate field if no channel link enabled */
    if ((!psTransfer->bEnableChannelMajorLoopLink) && (!psTransfer->bEnableChannelMinorLoopLink))
    {
        psTcd->u16CITER &= ~(uint16_t)DMA_CITER_ELINKYES_ELINK_MASK;
        psTcd->u16BITER &= ~(uint16_t)DMA_BITER_ELINKYES_ELINK_MASK;
        psTcd->u16CSR &= ~(uint16_t)DMA_CSR_MAJORELINK_MASK;
    }

    /* major loop offset */
    psTcd->u32SLAST = (uint32_t)psTransfer->i32SrcMajorLoopOffset;
    /* modulo feature */
    u16Tmpreg      = psTcd->u16ATTR & (~(uint16_t)(DMA_ATTR_SMOD_MASK | DMA_ATTR_DMOD_MASK));
    psTcd->u16ATTR = u16Tmpreg | DMA_ATTR_DMOD(psTransfer->eDstAddrModulo) | DMA_ATTR_SMOD(psTransfer->eSrcAddrModulo);
}

/*!
 * brief Creates the eDMA channel handle.
 *
 * This function is called if using the transactional API for eDMA. This function
 * initializes the internal state of the eDMA handle.
 *
 * param base eDMA peripheral base address.
 * param handle eDMA handle pointer. The eDMA handle stores callback function and
 *               parameters.
 * param channel eDMA channel number.
 * param psTcdPool A memory pool to store TCDs. It must be 32 bytes aligned.
 * param u32TcdCount The number of TCD slots.
 * param callback eDMA callback function pointer.
 * param userData A parameter for the callback function.
 *
 */
void EDMA_TransferCreateHandle(DMA_Type *base,
                               edma_handle_t *psHandle,
                               edma_channel_t eChannel,
                               edma_channel_tcd_t *psTcdPool,
                               uint32_t u32TcdCount,
                               edma_transfer_callback_t pfCallback,
                               void *pUserData)
{
    assert(psHandle != NULL);
    assert(eChannel < (uint32_t)FSL_FEATURE_EDMA_MODULE_CHANNEL);
    assert(psTcdPool != NULL);
    assert(((uint32_t)((uint8_t *)psTcdPool) & 0x1FU) == 0U);

    uint32_t u32EdmaInstance;
    uint32_t eChannelIndex;
    edma_channel_tcd_t *psTcdRegs;

    /* Zero the handle */
    (void)memset(psHandle, 0, sizeof(edma_handle_t));

    psHandle->psBase     = base;
    psHandle->eChannel   = eChannel;
    psHandle->pfCallback = pfCallback;
    psHandle->pUserData  = pUserData;
    /* Get the DMA instance number */
    u32EdmaInstance = EDMA_GetInstance(base);
    eChannelIndex   = (EDMA_GetInstanceOffset(u32EdmaInstance) * (uint32_t)FSL_FEATURE_EDMA_MODULE_CHANNEL) + eChannel;
    s_EDMAHandle[eChannelIndex] = psHandle;

    /* Enable interrupt */
    (void)EnableIRQ(s_edmaIRQNumber[u32EdmaInstance][eChannel]);

    /*Reset TCD registers to zero.*/
    psTcdRegs = (edma_channel_tcd_t *)(uint32_t)&psHandle->psBase->TCD[eChannel];
    EDMA_TcdReset(psTcdRegs);

    /* Initialize tcd queue attribute. */
    psHandle->u8Header  = 0;
    psHandle->u8Tail    = 0;
    psHandle->u8TcdUsed = 0;
    psHandle->u8TcdSize = (int8_t)u32TcdCount;
    psHandle->psTcdPool = psTcdPool;
}

/*!
 * brief Submits the eDMA single transfer configuration.
 *
 * Application can submit single transfer when
 * 1. channel is idle, the transfer request will be submitted to eDMA channel TCD register directly
 * 2. channel is idle, a previous transfer request is pending, the new transfer request will be submitted to the
 * installed TCD pool and linked to the pending one.
 * 3. channel is active, the transfer request will be submitted to the installed TCD pool and linked to previous one.
 *
 * note,
 * 1.Please be aware of that tcd pool maintain is unprotect by default, that is to say, the behavior of multiple task
 * trying to access the same channel is undefine, application can protect the channel by itself or overwrite
 * EDMA_ENTER_CRITICAL_SECTION/EDMA_LEAVE_CRITICAL_SECTION to have edma driver protect the TCD pool maintain.
 * 2.Since the destination major loop offset feature register is reused as scatter gather tcd address, so the two
 * features cannot be used together, if the destination major loop offset feature is used, then the transfer request
 * will be submit hardware TCD directly.
 *
 * It is suggest that application should check the return value of this function to make sure that the transfer request
 * is submitted successfully.
 *
 * param psHandle eDMA handle pointer.
 * param psTransfer pointer to user's eDMA channel configure structure, see edma_channel_transfer_config_t for detail.
 *
 * retval #kStatus_EDMA_Success It means submit transfer request succeed.
 * retval #kStatus_EDMA_QueueFull It means TCD queue is full. Submit transfer request is not allowed.
 */
status_t EDMA_TransferSubmitSingleTransfer(edma_handle_t *psHandle, edma_channel_transfer_config_t *psTransfer)
{
    assert(psHandle != NULL);
    assert(psTransfer != NULL);
    assert(psHandle->psTcdPool != NULL);

    edma_channel_tcd_t *tcdRegs = (edma_channel_tcd_t *)(uint32_t)&psHandle->psBase->TCD[psHandle->eChannel];
    uint16_t u16Csr;
    uint8_t u8CurrentTcd;
    uint8_t u8PreviousTcd;
    uint8_t u8NextTcd;
    uint8_t u8TmpTcdUsed;
    uint8_t u8TmpTcdSize;

    /* Check if tcd pool is full. */
    EDMA_ENTER_CRITICAL_SECTION();
    u8TmpTcdUsed = psHandle->u8TcdUsed;
    u8TmpTcdSize = psHandle->u8TcdSize;
    if (u8TmpTcdUsed >= u8TmpTcdSize)
    {
        EDMA_LEAVE_CRITICAL_SECTION();

        return kStatus_EDMA_ChannelQueueFull;
    }
    u8CurrentTcd = psHandle->u8Tail;
    psHandle->u8TcdUsed++;
    /* Calculate index of next TCD */
    u8NextTcd = u8CurrentTcd + 1;
    if (u8NextTcd == psHandle->u8TcdSize)
    {
        u8NextTcd = 0;
    }
    /* Advance queue tail index */
    psHandle->u8Tail = u8NextTcd;
    EDMA_LEAVE_CRITICAL_SECTION();
    /* Calculate index of previous TCD */
    u8PreviousTcd = u8CurrentTcd != 0 ? u8CurrentTcd - 1 : (psHandle->u8TcdSize - 1);
    /* convert transfer configuration to TCD */
    EDMA_TcdReset(&psHandle->psTcdPool[u8CurrentTcd]);
    EDMA_ConfigChannelSoftwareTCD(&psHandle->psTcdPool[u8CurrentTcd], psTransfer);

    /* enable scatter gather only when destination major loop offset feature is disabled */
    if (psTransfer->i32DstMajorLoopOffset == 0U)
    {
        /* Link current TCD with next TCD for identification of current TCD */
        psHandle->psTcdPool[u8CurrentTcd].u32DLAST_SGA = (uint32_t)((uint8_t *)(&psHandle->psTcdPool[u8NextTcd]));
        /* Chain from previous descriptor unless tcd pool size is 1(this descriptor is its own predecessor). */
        if (u8CurrentTcd != u8PreviousTcd)
        {
            /* Enable scatter/gather feature in the previous TCD block. */
            u16Csr = psHandle->psTcdPool[u8PreviousTcd].u16CSR | ((uint16_t)DMA_CSR_ESG_MASK);
            u16Csr &= ~((uint16_t)DMA_CSR_DREQ_MASK);
            psHandle->psTcdPool[u8PreviousTcd].u16CSR = u16Csr;
            /*
                Check if the TCD block in the registers is the previous one (points to current TCD block). It
                is used to check if the previous TCD linked has been loaded in TCD register. If so, it need to
                link the TCD register in case link the current TCD with the dead chain when TCD loading occurs
                before linking the previous TCD block.
            */
            if (tcdRegs->u32DLAST_SGA == (uint32_t)((uint8_t *)(&psHandle->psTcdPool[u8CurrentTcd])))
            {
                /* Clear the DREQ bits for the dynamic scatter gather */
                tcdRegs->u16CSR |= DMA_CSR_DREQ_MASK;
                /* Enable scatter/gather also in the TCD registers. */
                u16Csr = tcdRegs->u16CSR | DMA_CSR_ESG_MASK;
                /* Must write the CSR register one-time, because the transfer maybe finish anytime. */
                tcdRegs->u16CSR = u16Csr;
                /*
                    It is very important to check the ESG bit!
                    Because this hardware design: if DONE bit is set, the ESG bit can not be set. So it can
                    be used to check if the dynamic TCD link operation is successful. If ESG bit is not set
                    and the DLAST_SGA is not the next TCD address(it means the dynamic TCD link succeed and
                    the current TCD block has been loaded into TCD registers), it means transfer has finished
                    and TCD link operation fail, so must install TCD content into TCD registers and enable
                    transfer again. And if ESG is set, it means transfer has not finished, so TCD dynamic
                    link succeed.
                */
                if (0U != (tcdRegs->u16CSR & DMA_CSR_ESG_MASK))
                {
                    tcdRegs->u16CSR &= ~(uint16_t)DMA_CSR_DREQ_MASK;
                    return kStatus_Success;
                }
                /*
                    Check whether the current TCD block is already loaded in the TCD registers. It is another
                    condition when ESG bit is not set: it means the dynamic TCD link succeeds and the current
                    TCD block has been loaded into TCD registers.
                */
                if (tcdRegs->u32DLAST_SGA == (uint32_t)((uint8_t *)(&psHandle->psTcdPool[u8NextTcd])))
                {
                    return kStatus_Success;
                }
                /*
                    If go to this, means the previous transfer finished, and the DONE bit is set.
                    So shall configure TCD registers.
                */
            }
            else if (tcdRegs->u32DLAST_SGA != 0UL)
            {
                /* The current TCD block has been linked successfully. */
                return kStatus_Success;
            }
            else
            {
                /*
                    DLAST_SGA is 0 and it means the first submit transfer, so shall configure
                    TCD registers.
                */
            }
        }
    }
    /* enable minor loop mapping if minor loop offset feature is used */
    if (((psTransfer->bEnableSrcMinorLoopOffset) || (psTransfer->bEnableDstMinorLoopOffset)))
    {
        EDMA_EnableMinorLoopMapping(psHandle->psBase, true);
    }
    /* There is no live chain, TCD block need to be installed in TCD registers. */
    EDMA_InstallChannelSoftwareTCD(psHandle->psBase, psHandle->eChannel, &psHandle->psTcdPool[u8CurrentTcd]);

    /* enable interrupt */
    EDMA_EnableChannelInterrupts(psHandle->psBase, psHandle->eChannel,
                                 psTransfer->u16EnabledInterruptMask & kEDMA_ChannelErrorInterruptEnable, true);

    return kStatus_Success;
}

/*!
 * brief Submits the eDMA scatter gather transfer configurations.
 *
 * The function is target for submit loop transfer request,
 * the ring transfer request means that the transfer request TAIL is link to HEAD, such as,
 * A->B->C->D->A, or A->A
 *
 * To use the ring transfer feature, the application should allocate several transfer object, such as
 * @code
 * edma_channel_transfer_config_t transfer[2];
 * EDMA_TransferSubmitLoopTransfer(psHandle, &transfer, 2U);
 * @endcode
 * Then eDMA driver will link transfer[0] and transfer[1] to each other
 *
 * note Application should check the return value of this function to avoid transfer request
 * submit failed
 *
 * param psHandle eDMA handle pointer
 * param psTransfer pointer to user's eDMA channel configure structure, see edma_channel_transfer_config_t for detail
 * param transferLoopCount the count of the transfer ring, if loop count is 1, that means that the one will link to
 * itself.
 *
 * retval #kStatus_EDMA_Success It means submit transfer request succeed
 * retval #kStatus_EDMA_ChannelBusy channel is in busy status
 * retval #kStatus_EDMA_QueueFull It means TCD pool is not len enough for the ring transfer request
 */
status_t EDMA_TransferSubmitLoopTransfer(edma_handle_t *psHandle,
                                         edma_channel_transfer_config_t *psTransfer,
                                         uint32_t transferLoopCount)
{
    assert(psTransfer != NULL);
    assert(psHandle != NULL);
    assert(psHandle->psTcdPool != NULL);

    uint32_t i                                              = 0U;
    edma_channel_transfer_config_t *psCurrentTransferConfig = psTransfer;

    if (psHandle->u8TcdSize < transferLoopCount)
    {
        return kStatus_EDMA_ChannelQueueFull;
    }

