nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_edma.c
    /*
     *    Check if EDMA channel is busy:
     *    1. if channel active bit is set, it implies that minor loop is executing, then channel is busy
     *    2. if channel active bit is not set and BITER not equal to CITER, it implies that major loop is executing,
     *       then channel is busy
     *
     *    There is one case can not be covered in below condition:
     *    When transfer request is submitted, but no request from peripheral, that is to say channel service doesn't
     *    begin, if application would like to submit another transfer , then the TCD will be overwritten, since the
     *    ACTIVE is 0 and BITER = CITER, for such case, it is a scatter gather(link TCD) case actually, so
     *    application should enabled TCD pool for dynamic scatter gather mode by calling EDMA_InstallTCDMemory.
     */
    if (((psHandle->psBase->TCD[psHandle->eChannel].CSR & DMA_CSR_ACTIVE_MASK) != 0U) ||
        (((psHandle->psBase->TCD[psHandle->eChannel].CITER_ELINKNO & DMA_CITER_ELINKNO_CITER_MASK) !=
          (psHandle->psBase->TCD[psHandle->eChannel].BITER_ELINKNO & DMA_BITER_ELINKNO_BITER_MASK))))
    {
        return kStatus_EDMA_ChannelBusy;
    }

    memset(psHandle->psTcdPool, 0U, psHandle->u8TcdSize * sizeof(edma_channel_tcd_t));

    for (i = 0U; i < transferLoopCount - 1; i++)
    {
        psTransfer[i].psLinkTCD = &psHandle->psTcdPool[i + 1];
        EDMA_ConfigChannelSoftwareTCD(&(psHandle->psTcdPool[i]), &psTransfer[i]);
    }

    /* prepare last one in the ring and link it to the HEAD of the ring */
    psTransfer[i].psLinkTCD = &psHandle->psTcdPool[0];
    EDMA_ConfigChannelSoftwareTCD(&(psHandle->psTcdPool[i]), &psTransfer[i]);
    if (((psTransfer->bEnableSrcMinorLoopOffset) || (psTransfer->bEnableDstMinorLoopOffset)))
    {
        EDMA_EnableMinorLoopMapping(psHandle->psBase, true);
    }
    /* There is no live chain, TCD block need to be installed in TCD registers. */
    EDMA_InstallChannelSoftwareTCD(psHandle->psBase, psHandle->eChannel, &psHandle->psTcdPool[0U]);

    /* enable interrupt */
    EDMA_EnableChannelInterrupts(psHandle->psBase, psHandle->eChannel,
                                 psTransfer->u16EnabledInterruptMask & kEDMA_ChannelErrorInterruptEnable, true);

    return kStatus_Success;
}

/*!
 * brief eDMA starts transfer.
 *
 * This function enables the channel request. Users can call this function after submitting the transfer request
 * or before submitting the transfer request.
 *
 * param psHandle eDMA handle pointer.
 */
void EDMA_TransferStart(edma_handle_t *psHandle)
{
    assert(psHandle != NULL);
    uint32_t u32TmpCSR = 0;

    edma_channel_tcd_t *psTcdRegs = (edma_channel_tcd_t *)(uint32_t)&psHandle->psBase->TCD[psHandle->eChannel];

    /* Check if channel request is actually disable. */
    if ((psHandle->psBase->ERQ & ((uint32_t)1U << psHandle->eChannel)) == 0U)
    {
        /* Check if transfer is paused. */
        u32TmpCSR = psTcdRegs->u16CSR;
        if ((0U == (u32TmpCSR & DMA_CSR_DONE_MASK)) || (0U != (u32TmpCSR & DMA_CSR_ESG_MASK)))
        {
            /*
                Re-enable channel request must be as soon as possible, so must put it into
                critical section to avoid task switching or interrupt service routine.
            */
            psHandle->psBase->SERQ = DMA_SERQ_SERQ(psHandle->eChannel);
        }
    }
}

/*!
 * brief eDMA stops transfer.
 *
 * This function disables the channel request to pause the transfer. Users can call EDMA_StartTransfer()
 * again to resume the transfer.
 *
 * param psHandle eDMA handle pointer.
 */
void EDMA_TransferStop(edma_handle_t *psHandle)
{
    assert(psHandle != NULL);

    psHandle->psBase->CERQ = DMA_CERQ_CERQ(psHandle->eChannel);
}

/*!
 * brief eDMA aborts transfer.
 *
 * This function disables the channel request and clear transfer status bits.
 * Users can submit another transfer after calling this API.
 *
 * param psHandle DMA handle pointer.
 */
void EDMA_TransferAbort(edma_handle_t *psHandle)
{
    psHandle->psBase->CERQ = DMA_CERQ_CERQ(psHandle->eChannel);
    /*
        Clear CSR to release channel. Because if the given channel started transfer,
        CSR will be not zero. Because if it is the last transfer, DREQ will be set.
        If not, ESG will be set.
    */
    psHandle->psBase->TCD[psHandle->eChannel].CSR = 0;
    /* Cancel all next TCD transfer. */
    psHandle->psBase->TCD[psHandle->eChannel].DLAST_SGA = 0;

    psHandle->u8Header  = 0;
    psHandle->u8Tail    = 0;
    psHandle->u8TcdUsed = 0;
}

/*!
 * brief eDMA IRQ handler for the current major loop transfer completion.
 *
 * This function clears the channel major interrupt flag and calls
 * the callback function if it is not NULL.
 *
 * Note:
 * For the case using TCD queue, when the major iteration count is exhausted, additional Interfaces are performed.
 * These include the final address adjustments and reloading of the BITER field into the CITER.
 * Assertion of an optional interrupt request also occurs at this time, as does a possible fetch of a new TCD from
 * memory using the scatter/gather address pointer included in the descriptor (if scatter/gather is enabled).
 *
 * For instance, when the time interrupt of TCD[0] happens, the TCD[1] has already been loaded into the eDMA engine.
 * As sga and sga_index are calculated based on the DLAST_SGA bit field lies in the TCD_CSR register, the sga_index
 * in this case should be 2 (DLAST_SGA of TCD[1] stores the address of TCD[2]). Thus, the "tcdUsed" updated should be
 * (tcdUsed - 2U) which indicates the number of TCDs can be loaded in the memory pool (because TCD[0] and TCD[1] have
 * been loaded into the eDMA engine at this point already.).
 *
 * For the last two continuous ISRs in a scatter/gather process, they  both load the last TCD (The last ISR does not
 * load a new TCD) from the memory pool to the eDMA engine when major loop completes.
 * Therefore, ensure that the header and tcdUsed updated are identical for them.
 * tcdUsed are both 0 in this case as no TCD to be loaded.
 *
 * See the "eDMA basic data flow" in the eDMA Functional description section of the Reference Manual for
 * further details.
 *
 * param psHandle eDMA handle pointer.
 */
void EDMA_TransferHandleIRQ(edma_handle_t *psHandle)
{
    assert(psHandle != NULL);

    bool bTransferDone;

    /* Clear EDMA interrupt flag */
    psHandle->psBase->CINT = psHandle->eChannel;
    /* Check if transfer is already finished. */
    bTransferDone = ((psHandle->psBase->TCD[psHandle->eChannel].CSR & DMA_CSR_DONE_MASK) != 0U);

    uint32_t u32Sga = psHandle->psBase->TCD[psHandle->eChannel].DLAST_SGA;
    uint32_t u32SgaIndex;
    int32_t i32TcdsDone;
    uint8_t u8NewHeader;

    /* Get the offset of the next transfer TCD blocks to be loaded into the eDMA engine. */
    u32Sga -= (uint32_t)(uint8_t *)psHandle->psTcdPool;
    /* Get the index of the next transfer TCD blocks to be loaded into the eDMA engine. */
    u32SgaIndex = u32Sga / sizeof(edma_channel_tcd_t);
    /* Adjust header positions. */
    if (bTransferDone)
    {
        /* New header shall point to the next TCD to be loaded (current one is already finished) */
        u8NewHeader = (uint8_t)u32SgaIndex;
    }
    else
    {
        /* New header shall point to this descriptor currently loaded (not finished yet) */
        u8NewHeader = u32SgaIndex != 0U ? (uint8_t)u32SgaIndex - 1U : (uint8_t)psHandle->u8TcdSize - 1U;
    }
    /* Calculate the number of finished TCDs */
    if (u8NewHeader == (uint8_t)psHandle->u8Header)
    {
        uint8_t u8TmpTcdUsed = psHandle->u8TcdUsed;
        uint8_t u8TmpTcdSize = psHandle->u8TcdSize;

        if (u8TmpTcdUsed == u8TmpTcdSize)
        {
            i32TcdsDone = psHandle->u8TcdUsed;
        }
        else
        {
            /* No TCD in the memory are going to be loaded or internal error occurs. */
            i32TcdsDone = 0;
        }
    }
    else
    {
        i32TcdsDone = (uint32_t)u8NewHeader - (uint32_t)psHandle->u8Header;
        if (i32TcdsDone < 0)
        {
            i32TcdsDone += psHandle->u8TcdSize;
        }
    }
    /* Advance header which points to the TCD to be loaded into the eDMA engine from memory. */
    psHandle->u8Header = u8NewHeader;
    /* Release TCD blocks. tcdUsed is the TCD number which can be used/loaded in the memory pool. */
    psHandle->u8TcdUsed -= (uint8_t)i32TcdsDone;
    /* Invoke callback function. */
    if (NULL != psHandle->pfCallback)
    {
        (psHandle->pfCallback)(psHandle, psHandle->pUserData, bTransferDone, i32TcdsDone);
    }

    /* clear the DONE bit here is meaningful for below cases:
     *1.A new TCD has been loaded to EDMA already:
     * need to clear the DONE bit in the IRQ psHandler to avoid TCD in EDMA been overwritten
     * if peripheral request isn't coming before next transfer request.
     *2.A new TCD has not been loaded to EDMA:
     * for the case that transfer request occurs in the previous edma callback, this is a case that doesn't
     * need scatter gather, so keep DONE bit during the next transfer request will re-install the TCD.
     */
    if (bTransferDone)
    {
        psHandle->psBase->CDNE = psHandle->eChannel;
    }
}

void DMA0_DriverIRQHandler(void);
void DMA0_DriverIRQHandler(void)
{
    EDMA_TransferHandleIRQ(s_EDMAHandle[0]);
}

void DMA1_DriverIRQHandler(void);
void DMA1_DriverIRQHandler(void)
{
    EDMA_TransferHandleIRQ(s_EDMAHandle[1]);
}

void DMA2_DriverIRQHandler(void);
void DMA2_DriverIRQHandler(void)
{
    EDMA_TransferHandleIRQ(s_EDMAHandle[2]);
}

void DMA3_DriverIRQHandler(void);
void DMA3_DriverIRQHandler(void)
{
    EDMA_TransferHandleIRQ(s_EDMAHandle[3]);
}
